chore: agent improvements
